/*:
 *
 * @plugindesc (v3.1.1) 玩家探索插件
 * @author マンカインド
 *
 * @help = 玩家探索插件 =
 * MKR_PlayerSensor.js
 *
 * 绘制目标事件（以下称为探索者）的视野范围，
 * 当玩家位于范围内时，
 * 该探索者进入发现状态并将指定的开关设为ON。
 * （开关为ON期间，探索者不会转向被搭话的方向）
 *
 * 当玩家移出视野范围格子外时，
 * 进入丢失状态，已开启的开关变为OFF。
 * （可通过设置调整状态转换的时间）
 *
 * ※ 当触发器[自动执行]的事件运行中时，考虑到游戏运行负荷，
 *    探索处理会停止。
 *    （可在事件备注栏中更改设置）
 *
 *
 * 简单使用说明:
 *   设置想要作为探索者的事件的备注栏，
 *   在有探索者的地图上执行插件命令 PSS start 时，
 *   该地图上的所有探索者开始探索。
 *   （探索临时无效状态的探索者除外）
 *
 *   在有探索者的地图上执行插件命令 PSS force_start 时，
 *   该地图上的所有探索者开始探索。
 *   （探索临时无效状态的探索者也会开始探索）

 *   在探索者的事件内执行插件命令 PSS t_start 时，
 *   该探索者开始探索。
 *   （对处于探索临时无效状态的探索者也会开始探索。）
 *
 *   在探索者的事件内执行插件命令 PSS t_stop 时，
 *   该探索者停止探索。
 *   （状态更新为玩家未发现。）
 *
 *   在有探索者的地图上执行插件命令 PSS stop 时，
 *   该地图上的所有探索者停止探索。
 *   （状态更新为玩家未发现。）
 *
 *
 * 备注栏_基本设置(X为正整数):
 *   <PsensorL:X>
 *     ・探索者前方X格的范围。
 *
 *   <PsensorF:X>
 *     ・以探索者为顶点，向前方X格、
 *       左右各X格的点连接形成的
 *       三角形图形范围内进行探索。
 *
 *   <PsensorD:X>
 *     ・探索者上下左右各X格的点连接形成的
 *       菱形图形范围内进行探索。
 *
 *     ・此形状的情况下，忽略地形的通行可能状态。
 *       （始终处于Td选项为1的状态。）
 *
 *   <PsensorS:X>
 *     ・探索者上下各X格、
 *       左右各X格的点连接形成的
 *       四角形图形范围内进行探索。
 *
 *     ・此形状的情况下，忽略地形的通行可能状态。
 *       （始终处于Td选项为1的状态）
 *
 *   <PsensorL:\V[n]>
 *     ・指定视野范围格数的部分，
 *       可以使用表示变量的控制字符 \V[n]。
 *       使用变量编号N的变量中存储的值
 *       作为范围值。
 *       （变量的更改会实时反映）
 *
 *   <!PsensorL:X>
 *     ・探索者前方X格为范围，但
 *       在开头添加!时会变为探索临时无效状态。
 *
 *     ・此状态下，在后述插件命令:PSS start执行时
 *       不会开始探索，
 *         需要通过插件命令:PSS t_start 或
 *         脚本命令:$gameSystem.onSensor(eventId)
 *       单独开始探索。
 *
 *
 * 备注栏_选项(各选项用空格分隔):
 *     ・各选项用空格分隔。
 *     ・不指定时将应用初始值设置。
 *
 *   Sw[数字或A～D]
 *     ・探索者发现玩家时
 *       要开启的开关编号或自开关
 *       为每个探索者指定。
 *
 *     ・玩家丢失时开启的开关，
 *       在发现玩家时会自动关闭。
 *
 *     例)
 *       Sw10 : 将开关编号10的开关设为ON。
 *       SwC  : 将探索者的自开关C设为ON。
 *
 *   Bo[0～1的数字，或\S[n]]
 *     ・探索者两侧不作为探索范围(0)/作为探索范围(1)。
 *       为1时，探索者的左右格成为探索范围。
 *
 *     ・\S[n]是获取开关状态的控制字符。
 *       N可输入数值或A～D的字母。(A～D是自开关)
 *       开关N的状态为ON = 与指定1相同。
 *
 *   Rv[0～1的数字，或\S[n]]
 *     ・不绘制(0)/绘制(1)探索者的视野范围。
 *       为0时，探索者的视野范围不会在画面上绘制。
 *       (只是视觉上看不见，探索仍会进行)
 *
 *     ・\S[n]是获取开关状态的控制字符。
 *       N可输入数值或A～D的字母。(A～D是自开关)
 *       开关N的状态为ON = 与指定1相同。
 *
 *   Td[0或1，或\S[n]]
 *     ・视野范围的计算不考虑(0)/考虑(1)视野范围内的地形/事件
 *       通行可能状态。
 *       为1时，视野范围内有不可通行格时视野范围会发生变化。
 *
 *     ・考虑地形通行可能状态时，
 *       不可通行格不成为视野范围的对象，
 *       从探索者看因不可通行格而形成的
 *       死角格也不成为视觉范围的对象。
 *
 *     ・\S[n]是获取开关状态的控制字符。
 *       N可输入数值或A～D的字母。(A～D是自开关)
 *       开关N的状态为ON = 与指定1相同。
 *
 *   Di[U,R,L,D中的1个字符]
 *     ・不考虑探索者的朝向，固定探索方向。
 *       U表示上，R表示右，L表示左，D表示下。
 *
 *   Ev[0或1，或\S[n]]
 *     ・探索者的视野范围受到(1)/不受到(0)地图上不可通行事件
 *       (优先度为"与普通角色相同")的
 *       影响。
 *       为1时，视野范围内有不可通行的地图事件时
 *       视野范围会发生变化。
 *
 *     ・将[图块集 B]以后的图块指定为事件的图像且
 *       事件的优先度为"普通角色下方"时，
 *       图块集的通行可能设置会影响视野范围，
 *       图块集设置为不可通行时，会变为视野范围外。
 *
 *     ・设为不考虑视野范围内的通行可能状态时，
 *       此设置会被忽略。
 *
 *   Rg[区域编号，或\V[n]]
 *     ・指定时探索者的视野范围会受到地图上区域图块的
 *       影响。
 *       例如指定1时，放置区域编号1的图块的格子
 *       被视为墙壁，变为视野范围外。
 *
 *     ・设为不考虑视野范围内的通行可能状态时，
 *       此设置会被忽略。
 *
 *   Fb[气泡编号，或\V[n]]
 *     ・指定时，探索者发现玩家时
 *       在探索者头上显示气泡。
 *
 *   Fc[公共事件编号，或\V[n]]
 *     ・指定时，探索者发现玩家时
 *       执行指定的公共事件。
 *
 *   Fd[延迟帧数，或\V[n]]
 *     ・指定时，探索者发现玩家的时间
 *       延迟指定的帧数。
 *
 *   Lb[气泡编号，或\V[n]]
 *     ・指定时，探索者丢失玩家时
 *       在探索者头上显示气泡。
 *
 *   Lc[公共事件编号，或\V[n]]
 *     ・指定时，探索者丢失玩家时
 *       执行指定的公共事件。
 *
 *   Ld[延迟帧数，或\V[n]]
 *     ・指定时，探索者丢失玩家的时间
 *       延迟指定的帧数。
 *
 *   Li
 *     ・指定时，即使玩家移出探索者的视野外
 *       探索者也不会转换为玩家丢失状态。
 *
 *     ・适用于一旦被发现就在同一地图内
 *       持续追踪玩家的事件等。
 *
 *     ・可以使用脚本等方式转换为玩家丢失状态。
 *
 *   Am[0或1，或\S[n]]
 *     ・自动执行事件运行中，设置了此选项的探索者的
 *       探索处理继续(1)/不继续(0)
 *       默认为0。
 *
 *     ・继续探索时，即使自动执行事件运行中
 *       也会进行视野范围内是否有玩家的判定。
 *       (仅限目标探索者处于探索开始状态时)
 *
 *     ・此选项设为1的探索者，在探索开始状态期间
 *       会持续探索，因此游戏运行负荷会增加。
 *       请谨慎设置。
 *
 *   Lsw[数字或A～D]
 *     ・探索者丢失玩家时
 *       要开启的开关编号或自开关
 *       为每个探索者指定。
 *
 *     ・发现玩家时开启的开关，
 *       在丢失玩家时会自动关闭。
 *
 *     例)
 *       Lsw11 : 将开关编号11的开关设为ON。
 *       LswB  : 将探索者的自开关B设为ON。
 *
 *
 * 备注栏的设置示例:
 *   <PsensorL:7>
 *     ・探索者前方7格的范围。
 *
 *   <PsensorF:3>
 *     ・以探索者为顶点，前方3格左右3格的点
 *       连接形成的三角形图形范围内进行探索。
 *
 *   <PsensorL:\V[100]>
 *     ・探索者前方[变量编号100]格的范围。
 *
 *   <PsensorL:4 SwC>
 *     ・探索者前方4格的范围。
 *       发现玩家时将探索者的自开关C设为ON。
 *
 *   <PsensorF:5 Bo1>
 *     ・以探索者为顶点，前方3格左右3格的点
 *       连接形成的三角形图形范围内进行探索。
 *
 *     ・此外将探索者的两侧作为探索范围。
 *
 *   <PsensorL:10 Rv0>
 *     ・探索者前方10格的范围，但
 *       不绘制视野范围。
 *
 *   <PsensorL:10 Rv\s[20]>
 *     ・探索者前方10格的范围。
 *
 *     ・开关20号状态为OFF时
 *       不绘制视野范围。
 *
 *   <PsensorL:10 Td0>
 *     ・探索者前方10格的范围，但
 *       不考虑视野范围内的通行可能格状态。
 *
 *   <PsensorL:10 Td\s[A]>
 *     ・探索者前方10格的范围。
 *
 *     ・自开关A状态为OFF时
 *       不考虑视野范围内的通行可能格状态。
 *
 *   <PsensorF:&2 Bo0 Sw1>
 *     ・以探索者为顶点，前方[变量编号2]格
 *       左右[变量编号2]格的点连接形成的
 *       三角形图形范围内进行探索，但
 *       不将探索者的两侧作为范围。
 *
 *     ・发现玩家时将开关编号1的开关设为ON。
 *
 *   <PsensorL:7 DiR>
 *     ・探索者右侧7格的范围。
 *
 *   <PsensorF:7 DiU>
 *     ・以探索者为顶点，上方3格左右3格的点
 *       连接形成的三角形图形范围内进行探索。
 *
 *   <PsensorL:10 Ev1 Rg10>
 *     ・探索者前方10格的范围，但
 *       考虑视野范围内地图事件的存在。
 *       此外将区域编号10的图块识别为墙壁。
 *
 *
 * 插件命令:
 *   PSS start
 *     ・执行命令的地图上存在的所有探索者
 *       进入探索开始处理。
 *       (探索临时无效状态的探索者除外)
 *
 *   PSS force_start
 *     ・执行命令的地图上存在的所有探索者
 *       进入探索开始处理。
 *       (探索临时无效状态的探索者也成为对象)
 *
 *   PSS stop
 *     ・执行命令的地图上存在的所有探索者
 *       进入探索停止处理状态。
 *       (状态更新为玩家未发现。)
 *
 *   PSS reset X Y ...
 *     ・对执行命令的地图上存在的所有探索者，
 *       将插件参数[发现后操作开关]
 *       指定的(自)开关，
 *       或Sw选项指定的(自)开关
 *       其中之一设为OFF。(Sw选项的设置优先)
 *
 *     ・此外，reset后指定的(自)开关也
 *       同样设为OFF。要一起设为OFF时请指定。
 *       (X,Y 为自开关/开关编号。
 *        请用空格分隔记载)
 *
 *   PSS lost
 *     ・将执行命令的地图上存在的玩家发现状态的探索者
 *       强制转移到丢失状态。
 *
 *   PSS found
 *     ・将执行命令的地图上存在的玩家未发现状态的探索者
 *       强制转移到发现状态。
 *
 *   PSS t_start
 *     ・将执行此命令的探索者
 *       设为探索开始状态。
 *
 *     ・为了实际进行探索，需要事先执行PSS start命令。
 *
 *   PSS t_stop
 *     ・将执行此命令的探索者设为探索停止状态。
 *       (状态更新为玩家未发现。)
 *
 *   PSS t_reset X Y ...
 *     ・对执行此命令的探索者，
 *       将插件参数[发现后操作开关]
 *       指定的(自)开关，
 *       或备注栏Sw选项指定的(自)开关
 *       其中之一设为OFF。(备注栏的设置优先)
 *
 *     ・"X", "Y" 表示(自)开关，此处记载的(自)开关
 *       也同样设为OFF。要一起设为OFF时请指定。
 *       (自开关/开关编号请用空格分隔记载)
 *
 *   PSS t_lost
 *     ・将执行此命令的玩家发现状态的探索者
 *       强制转移到丢失状态。
 *
 *   PSS t_find
 *     ・将执行此命令的玩家未发现状态的探索者
 *       强制转移到发现状态。
 *
 *   PSS t_move X
 *     ・将执行此命令的事件移动到
 *       执行此命令时玩家位置的相邻位置。
 *
 *     ・X为移动速度。对应1～6，
 *       未指定时使用事件设置的速度。
 *
 *     ・插件参数[不可通行图块考虑]为OFF或
 *       备注栏Td选项为0时
 *       可能无法正确移动。
 *       (可通过启用事件的穿透来移动)
 *
 *
 * 脚本命令:
 *   $gameSystem.getEventSensorStatus(eventId)
 *     ・获取指定事件ID的探索者的探索状态。
 *       [返回值] | [含义]
 *          -1    | 探索临时无效状态
 *           0    | 探索停止状态
 *           1    | 探索执行状态
 *
 *   $gameSystem.onSensor(eventId)
 *     ・将指定事件ID的探索者设为探索开始状态。
 *       用于让探索停止/临时无效状态的探索者重新开始探索。
 *
 *     ・为了开始探索，需要事先执行PSS start(PSS force_start)命令。
 *
 *   $gameSystem.offSensor(eventId)
 *     ・将指定事件ID的探索者设为探索停止状态。
 *       (状态更新为玩家未发现。)
 *
 *   $gameSystem.neutralSensor(eventId, ["X","Y",...])
 *     ・对当前地图存在的、指定事件ID的探索者，
 *       将[发现后操作开关]指定的(自)开关或
 *       Sw选项指定的自开关
 *       其中之一设为OFF。(备注栏的设置优先)
 *
 *     ・"X", "Y" 表示(自)开关，此处记载的(自)开关
 *       也同样设为OFF。要一起设为OFF时请指定。
 *       (请用逗号分隔指定)
 *
 *   $gameSystem.isFoundPlayer()
 *     ・当前地图中，玩家被探索者发现时返回true。
 *       (其他情况返回false)
 *
 *   $gameSystem.allForceLost()
 *     ・将当前地图存在的玩家发现状态的探索者
 *       强制转移到丢失状态。
 *
 *   $gameSystem.forceLost(eventId)
 *     ・指定事件ID的探索者处于玩家发现状态时，
 *       强制转移到丢失状态。
 *
 *   $gameSystem.allForceFound()
 *     ・将当前地图存在的玩家未发现状态的探索者
 *       强制转移到发现状态。
 *
 *   $gameSystem.forceFound(eventId)
 *     ・指定事件ID的探索者处于玩家未发现状态时，
 *       强制转移到发现状态。
 *
 *
 * 補足：
 *   ・このプラグインに関するメモ欄の設定、プラグインコマンド、
 *     は大文字/小文字を区別していません。
 *
 *   ・プラグインパラメーターの説明に、[初期値]と書かれているものは
 *     メモ欄にて個別設定が可能です。
 *     設定した場合、[初期値]よりメモ欄の設定が
 *     優先されますのでご注意ください。
 *
 *   ・プラグインパラメーターの説明に、[変数可]と書かれているものは
 *     設定値に変数を表す制御文字である\V[n]を使用可能です。
 *     変数を設定した場合、そのパラメーターの利用時に変数の値を
 *     参照するため、パラメーターの設定をゲーム中に変更できます。
 *
 *   ・プラグインパラメーターの説明に、[スイッチ可]と書かれているものは
 *     設定値にスイッチを表す制御文字の\S[n]を使用可能です。(Nは数値)
 *     指定したスイッチがONの場合はプラグインパラメーターに
 *     ONまたは1,trueを指定したことと同じとなります。
 *     スイッチを設定した場合、そのパラメーターの利用時にスイッチの値を
 *     参照するため、パラメーターの設定をゲーム中に変更できます。
 *
 *
 * 利用規約:
 *   ・作者に無断で本プラグインの改変、再配布が可能です。
 *     (ただしヘッダーの著作権表示部分は残してください。)
 *
 *   ・利用形態(フリーゲーム、商用ゲーム、R-18作品等)に制限はありません。
 *     ご自由にお使いください。
 *
 *   ・本プラグインを使用したことにより発生した問題について作者は一切の責任を
 *     負いません。
 *
 *   ・要望などがある場合、本プラグインのバージョンアップを行う
 *     可能性がありますが、
 *     バージョンアップにより本プラグインの仕様が変更される可能性があります。
 *     ご了承ください。
 *
 * @param 探索設定
 * @default ====================================
 *
 * @param Sensor_Switch
 * @text 発見後操作スイッチ
 * @desc [初期値] プレイヤー発見時にONにするスイッチ番号またはセルフスイッチを指定。(ロスト後操作スイッチはOFFになります)
 * @type combo
 * @option A
 * @option B
 * @option C
 * @option D
 * @default D
 * @parent 探索設定
 *
 * @param Lost_Sensor_Switch
 * @text ロスト後操作スイッチ
 * @desc [初期値] プレイヤーロスト時にONにするスイッチ番号またはセルフスイッチを指定。(発見後操作スイッチはOFFになります)
 * @type combo
 * @option A
 * @option B
 * @option C
 * @option D
 * @default
 * @parent 探索設定
 *
 * @param Both_Sensor
 * @text 両隣の視界
 * @desc [初期値:スイッチ可] 探索者の両隣を探索範囲とする場合はON、しない場合はOFFを指定してください。
 * @type combo
 * @option ON
 * @option OFF
 * @default OFF
 * @parent 探索設定
 *
 * @param Terrain_Decision
 * @text 通行不可タイル考慮
 * @desc [初期値:スイッチ可] 視界範囲に通行不可タイルの存在を考慮させる場合はON、しない場合はOFFを指定してください。
 * @type combo
 * @option ON
 * @option OFF
 * @default ON
 * @parent 探索設定
 *
 * @param Auto_Sensor
 * @text 探索自動開始
 * @desc マップ描画時に探索処理を自動的に開始する設定です。デフォルト:開始しない
 * @type boolean
 * @on 開始する
 * @off 開始しない
 * @default false
 * @parent 探索設定
 *
 * @param Event_Decision
 * @text 他イベント考慮
 * @desc [初期値:スイッチ可] 視界範囲にマップイベントの存在を考慮させる場合はON、しない場合はOFFを指定してください。
 * @type combo
 * @option ON
 * @option OFF
 * @default OFF
 * @parent 探索設定
 *
 * @param Region_Decision
 * @text リージョン設定
 * @desc [初期値:変数可] 視界範囲外(壁扱い)とするリージョン番号を指定してください。
 * @type string[]
 * @default []
 * @parent 探索設定
 *
 * @param Real_Range_X
 * @text 探索範囲X拡張
 * @desc 探索範囲を指定した数値分、横に拡張します(視界描画はマス単位)。プレイヤーがピクセル単位で移動する場合に有効です。(デフォルト:0)
 * @type number
 * @decimals 3
 * @max 0.999
 * @min 0.000
 * @default 0.000
 * @parent 探索設定
 *
 * @param Real_Range_Y
 * @text 探索範囲Y拡張
 * @desc 探索範囲を指定した数値分、縦に拡張します(視界描画はマス単位)。プレイヤーがピクセル単位で移動する場合に有効です。(デフォルト:0)
 * @type number
 * @decimals 3
 * @max 0.999
 * @min 0.000
 * @default 0.000
 * @parent 探索設定
 *
 * @param 視界設定
 * @default ====================================
 *
 * @param Range_Visible
 * @text 視界範囲描画
 * @desc [初期値:スイッチ可] 探索者の視界範囲を描画する場合はON、しない場合はOFFを指定してください。
 * @type combo
 * @option ON
 * @option OFF
 * @default ON
 * @parent 視界設定
 *
 * @param Range_Color
 * @text 視界範囲の色
 * @desc 視界範囲を描画する際の色を選択してください。デフォルト:白
 * @type select
 * @option 白
 * @value white
 * @option 赤
 * @value red
 * @option 青
 * @value blue
 * @option 黄
 * @value yellow
 * @default white
 * @parent 視界設定
 *
 * @param Range_Opacity
 * @text 視界範囲の不透明度
 * @desc 視界範囲を描画する際の不透明度を数字で指定してください。デフォルト:80(0-255)
 * @type number
 * @min 0
 * @max 255
 * @default 80
 * @parent 視界設定
 *
 * @param Range_Position
 * @text 視界範囲位置
 * @desc 探索者の視界範囲を表示する位置を選択します。デフォルト:1(イベントの上に表示する)
 * @type select
 * @option イベントの上に表示する
 * @value 1
 * @option イベントの下に表示する
 * @value 2
 * @default 1
 * @parent 視界設定
 *
 * @param Player_Found
 * @text プレイヤー発見設定
 * @desc 探索者のプレイヤー発見に関する設定です。
 * @type struct<AlertFound>
 * @default {"Ballon":"0","Se":"{\"Name\":\"\",\"Volume\":\"90\",\"Pitch\":\"100\",\"Pan\":\"0\"}","Common_Event":"0","Delay":"0"}
 *
 * @param Player_Lost
 * @text プレイヤーロスト設定
 * @desc 探索者のプレイヤーロストに関する設定です。
 * @type struct<AlertLost>
 * @default {"Ballon":"0","Se":"{\"Name\":\"\",\"Volume\":\"90\",\"Pitch\":\"100\",\"Pan\":\"0\"}","Common_Event":"0","Delay":"0","Invalid":"false"}
 *
 * @param マップ設定
 * @default ====================================
 *
 * @param Tracking_Priority
 * @text 追跡優先度
 * @desc プレイヤー発見状態のイベントが他イベントの上または下を通行可能にするか設定します。(デフォルト:通行不可)
 * @type boolean
 * @on 通行可能
 * @off 通行不可
 * @default false
 * @parent マップ設定
 *
 * @param Follower_Through
 * @text フォロワー無視
 * @desc プレイヤー発見状態のイベントがプレイヤーのフォロワー(隊列)をすり抜けるか設定します。(デフォルト:すり抜け不可)
 * @type boolean
 * @on すり抜け可
 * @off すり抜け不可
 * @default false
 * @parent マップ設定
 *
 * @param Location_Reset
 * @text マップ移動時リセット
 * @desc 場所移動コマンド使用時、元のマップに配置された探索者の追跡状態をリセットするか設定します。(デフォルト:リセットしない)
 * @type boolean
 * @on リセットする
 * @off リセットしない
 * @default false
 * @parent マップ設定
 *
*/
/*~struct~AlertFound:
 *
 * @param Ballon
 * @text [初期値] フキダシ表示
 * @desc 探索者にフキダシを表示させる場合はアイコン番号を指定します。デフォルト:表示しない
 * @type select
 * @option 表示しない
 * @value 0
 * @option びっくり
 * @value 1
 * @option はてな
 * @value 2
 * @option 音符
 * @value 3
 * @option ハート
 * @value 4
 * @option 怒り
 * @value 5
 * @option 汗
 * @value 6
 * @option くしゃくしゃ
 * @value 7
 * @option 沈黙
 * @value 8
 * @option 電球
 * @value 9
 * @option Zzz
 * @value 10
 * @option ユーザー定義1
 * @value 11
 * @option ユーザー定義2
 * @value 12
 * @option ユーザー定義3
 * @value 13
 * @option ユーザー定義4
 * @value 14
 * @option ユーザー定義5
 * @value 15
 * @default 0
 *
 * @param Se
 * @text SE設定
 * @desc Seに関する設定です。
 * @type struct<Se>
 *
 * @param Common_Event
 * @text [初期値] コモン実行
 * @desc コモンイベントを実行させる場合は指定します。デフォルト:0(なし)
 * @type common_event
 * @default 0
 *
 * @param Delay
 * @text [初期値] 状態移行遅延
 * @desc プレイヤー発見状態に移行するタイミングを指定した
 * フレーム分遅らせます(60フレーム=1秒)。デフォルト:0
 * @type number
 * @min 0
 * @default 0
 *
 */
/*~struct~AlertLost:
 *
 * @param Ballon
 * @text [初期値] フキダシ表示
 * @desc 探索者にフキダシを表示させる場合はアイコン番号を指定します。デフォルト:表示しない
 * @type select
 * @option 表示しない
 * @value 0
 * @option びっくり
 * @value 1
 * @option はてな
 * @value 2
 * @option 音符
 * @value 3
 * @option ハート
 * @value 4
 * @option 怒り
 * @value 5
 * @option 汗
 * @value 6
 * @option くしゃくしゃ
 * @value 7
 * @option 沈黙
 * @value 8
 * @option 電球
 * @value 9
 * @option Zzz
 * @value 10
 * @option ユーザー定義1
 * @value 11
 * @option ユーザー定義2
 * @value 12
 * @option ユーザー定義3
 * @value 13
 * @option ユーザー定義4
 * @value 14
 * @option ユーザー定義5
 * @value 15
 * @default 0
 *
 * @param Se
 * @text SE設定
 * @desc Seに関する設定です。
 * @type struct<Se>
 *
 * @param Common_Event
 * @text [初期値] コモン実行
 * @desc コモンイベントを実行させる場合は指定します。デフォルト:0(なし)
 * @type common_event
 * @default 0
 *
 * @param Delay
 * @text [初期値] 状態移行遅延
 * @desc プレイヤーロスト状態に移行するタイミングを指定した
 * フレーム分遅らせます(60フレーム=1秒)。デフォルト:0
 * @type number
 * @min 0
 * @default 0
 *
 * @param Invalid
 * @text [初期値] 状態移行無効機能
 * @desc プレイヤーをロストした場合に状態を移行させません
 * (スクリプト等による手動移行は可能)。デフォルト:無効
 * @type boolean
 * @on 有効
 * @off 無効
 * @default false
 *
 */
/*~struct~Se:
 *
 * @param Name
 * @text ファイル名
 * @desc 再生するファイルを指定します。デフォルト:空(再生しない)
 * @type file
 * @require 1
 * @dir audio/se
 *
 * @param Volume
 * @text 再生時音量
 * @desc ファイルを再生するときの音量を指定します(0から100までの数値)。デフォルト:90
 * @type number
 * @max 100
 * @min 0
 * @default 90
 *
 * @param Pitch
 * @text 再生時ピッチ
 * @desc ファイルを再生するときのピッチを指定します(50から150までの数値)。デフォルト:100
 * @type number
 * @max 150
 * @min 50
 * @default 100
 *
 * @param Pan
 * @text 再生時位相
 * @desc ファイルを再生するときの位相を指定します(-100から100までの数値)。デフォルト:0
 * @type number
 * @max 100
 * @min -100
 * @default 0
 *
 */
